idnum = input("请输入您的身份证编号：")
name = input("请输入您的姓名：")
age = input("请输入您的年龄：")
sex = input("请输入您的性别：")
height = input("请输入您的身高：")
add = input("请输入您的居住地址：")
info ='''
      *******************您的个人信息******************
      *身份证编号:%s,                                *
      *姓名: %s,亲，你的名字真好听                      *
      *年龄: %s,亲，你真年轻                          *
      *性别: %s,亲，你真诚实                          *                          
      *身高: %s,亲，你真高                            *
      *居住地址:%s亲，你家真有钱                        *
      ***********************************************
'''
print(info  %  (idnum,name,age,sex,height,add))